# displaying rows with specific information

In [268]:
import pandas as pd
import re
import numpy as np

In [269]:
#name sütununa 
df = pd.DataFrame({
    'name': ['name1', 'name2', 'name3', 'name4', 'name5'],
    'info': ['info_z', 'info_y', 'info_x', 'info_z', 'info_z'],
    'Other':['other','other','other','other','other']
})

In [270]:
df_info=df
target_info=["x","y"]
data_info=[]
def f(x):
    for t in target_info:
        result=re.compile(t)
        if result.search(x):
            data_info.append(x)
            return x
    data_info.append(np.NaN)
            
    return np.NaN
df_info.aggregate({"info":[f]})

     info
        f
0     NaN
1  info_y
2  info_x
3     NaN
4     NaN

In [271]:
data_info

[nan, 'info_y', 'info_x', nan, nan]

In [272]:
#"new_info" sütunu için eski "info" sütunu silindi.
df.drop('info', inplace=True, axis=1)

In [273]:
#"name" ve "Other" sütunları arasına yeni sütun eklendi
df.insert(1,'new_info',data_info)

    name new_info  Other
0  name1      NaN  other
1  name2   info_y  other
2  name3   info_x  other
3  name4      NaN  other
4  name5      NaN  other

In [274]:
df=df.dropna()
df

    name new_info  Other
1  name2   info_y  other
2  name3   info_x  other